/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.c											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#include "calc_data.h"

/************************************************************/
/* 定数定義													*/
/************************************************************/


/************************************************************/
/* 変数定義													*/
/************************************************************/
double	meas_data[BUF_SIZE];			// 測定データ(パルスオキシメータ：生データ、無呼吸：calculator_apnea内yint(関数跨いで保持する必要あり))
double	temp_dbl_buf0[BUF_SIZE];		// 一時double型データ
double	temp_dbl_buf1[BUF_SIZE];		// 一時double型データ
double	temp_dbl_buf2[BUF_SIZE];		// 一時double型データ
double	temp_dbl_buf3[BUF_SIZE];		// 一時double型データ

int		temp_int_buf0[BUF_SIZE];		// 一時int型データ

/*==============================================================================*/
/* EOF */
