/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.h											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#ifndef		_CALC_DATA_H_		/* 二重定義防止 */
#define		_CALC_DATA_H_

#include "sys.h"

/************************************************************/
/*					マクロ定数定義							*/
/************************************************************/
#if 0	// データがRAMに収まらないため、一旦演算できるデータサイズを制限する

#define DATA_SIZE		(1500)	// 30秒間、20msに1回データ取得した数
#define BUF_SIZE		(3000)	// DATA_SIZE + 予備
//#define BUF_SIZE_APNEA	(30)	// 無呼吸・低呼吸の結果は生データの100分の1
#define BUF_SIZE_APNEA	(300)	// 無呼吸・低呼吸の結果は生データの100分の1

#else
// RAM5.5kBの制限のため、3秒間、20msに1回データ取得した数に抑える
#define DATA_SIZE		(120)	// 6秒間、50msに1回データ取得した数
#define BUF_SIZE		(120)	// DATA_SIZE + 予備
#define BUF_SIZE_APNEA	(12)	// 無呼吸・低呼吸の結果は生データの100分の1

#endif

/************************************************************/
/* 						型定義								*/
/************************************************************/


/************************************************************/
/*					外部参照宣言							*/
/************************************************************/
extern	double	meas_data[BUF_SIZE];			// 測定データ
extern	double	temp_dbl_buf0[BUF_SIZE];		// 一時double型データ
extern	double	temp_dbl_buf1[BUF_SIZE];		// 一時double型データ
extern	double	temp_dbl_buf2[BUF_SIZE];		// 一時double型データ
extern	double	temp_dbl_buf3[BUF_SIZE];		// 一時double型データ

extern	int		temp_int_buf0[BUF_SIZE];		// 一時int型データ

#endif	/*_CALC_DATA_H_*/
/************************************************************/
/* END OF TEXT												*/
/************************************************************/
