/****************************************************************************/
/* システム名   : RD1215 入出力BOX											*/
/* ファイル名   : com_srv.h													*/
/* 機能         : ログ通信(RS232C)											*/
/* 変更履歴		: 2018.01.25 Axia Soft Design 西島 稔	初版作成				*/
/* 注意事項     : なし														*/
/****************************************************************************/
#ifndef _COM_SRV_H_
#define _COM_SRV_H_


/************************************************************/
/* 定数定義													*/
/************************************************************/

/******************/
/*     型定義     */
/******************/



/******************/
/*  外部参照宣言  */
/******************/

extern void com_srv_init( void );
extern void com_srv_log_title( void );
extern void com_srv_cyc( void );
extern void com_srv_send( UB* tx_data, UB len );

/******************/
/* 関数マクロ定義 */
/******************/
	
#endif
