/********************************************************************************/
/* システム名   : RD1215 入出力BOX												*/
/* ファイル名   : vect_tbl.c                                                    */
/* 機能         : ブートプログラム用ベクタテーブル                              */
/* 変更履歴     : 2013.01.23 Axia Soft Design K.Wada    初版作成                */
/* 注意事項     : なし                                                          */
/********************************************************************************/

#include "header.h"

/********************/
/*     内部定数     */
/********************/


#pragma section const TBL_ID_CODE	//far属性

const UB __far ProductIdCode[PRODUCT_ID_SIZE] = {
	0x00,0x00,0x00,0x00,	/* size *//* ダウンロード時に設定される ※現在未使用 */
	0x00,0x00,0x00,0x00,	/* sum *//* ダウンロード時に設定される */
	'R','D','8','0','0','1',0x00,0x00	/* ID(機種固有情報) */
};

