/********************************************************************************/
/* システム名   : RD8001 快眠チェッカー                                         */
/* ファイル名   : vect_func.c                                                   */
/* 機能         : ブート、製品プログラム共通のベクタテーブル関数                */
/* 変更履歴     : 2013.01.23 Axia Soft Design K.Wada    初版作成                */
/*              : 2018.04.01 Axia Soft Design S.Shima   RD1215から流用開始      */
/* 注意事項     : なし                                                          */
/********************************************************************************/


#include "header.h"



/********************/
/*     内部変数     */
/********************/
/*ベクタ用RAM */
/* [配置根拠] FSL(フラッシュセルフライブラリ)が使用するFFE20Hの上に配置するが */
/* 将来の拡張性を考慮し、割り込み数64 * 4バイト = 0x100 分上の位置に配置する     */
/* 0xFFE20 - 0x100 = 0xFFD20 */
#pragma section bss   VECT_RAM
ST_VECT_FUNC	ram_vect_tbl[VECT_NUM_COUNT];


/************************************************************************/
/* 関数     : vect_set_tbl_apl                                          */
/* 関数名   : ベクタテーブル登録                                        */
/* 引数     : ベクタテーブルに登録するテーブルアドレス                  */
/* 戻り値   : なし                                                      */
/* 変更履歴 : 2013.01.23 Axia Soft Design K.Wada	初版作成            */
/************************************************************************/
/* 機能 :                                                               */
/************************************************************************/
/* 注意事項 :                                                           */
/************************************************************************/
void vect_set_tbl_apl(void);
void vect_set_tbl_apl(void)
{
	UH i;
	__far ST_VECT_FUNC * p_adr_buf = ( __far ST_VECT_FUNC *)PRODUCT_VECT_TBL_HEAD_ADDR;

	for( i=0;i<VECT_NUM_COUNT; i++ ){
		ram_vect_tbl[i].func = p_adr_buf[i].func;
	}
}



